from mathematic.arithmetic import division


def test_division():
    """
    Проверка деления двоичных числел
    """
    assert (division(['0', '0', '0', '0', '1', '1', '1', '1'],
                     ['0', '0', '0', '0', '0', '1', '1', '0'], 8) ==
            ['0', '0', '0', '0', '0', '1', '0', '1'])


def test_division2():
    """
    Проверка деления двоичных числел
    """
    assert (division(['0', '0', '0', '0', '1', '0', '1', '1'],
                     ['0', '0', '0', '0', '0', '1', '0', '1'], 8) ==
            ['0', '0', '0', '0', '0', '0', '1', '0'])
